# ForwardIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CorrectionFactorSet..::..ForwardIterator Method
CorrectionFactorSet Class See Also
---
Retrieve a forward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual CorrectionFactorSetIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As CorrectionFactorSetIterator
```

Visual C++
---
```text
public:
virtual CorrectionFactorSetIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the set.
# See Also
CorrectionFactorSet Class
Autodesk.Revit.DB.Electrical Namespace